cases/chpt4-ss304-3/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This is for gallium in cavity

//phaseChange 1.0;
alpha1TControl 1.0;
alphaInterfaceCut 1;
meltInterface 1e-6;
alpha2Capture 0.0005;

//phases (Phase1 Phase2);
phases (Phase1 Phase2 Phase3);

phaseChangeTwoPhaseMixture Weld;

pSat            0;   // Saturation pressure
pMin            0; 

sigma           0;//.05;//.01;//.3;//0.07;
sigma12         0.07;
sigma13         0;
sigma23         0;//0.07;
/*
*/
D23             0;

k [1 1 -3 -1 0 0 0] 1;//0;
nu [0 2 -1 0 0 0 0] 2.98e-07;
rho [1 -3 0 0 0 0 0] 6000;
cp [0 2 -2 -1 0 0 0] 381.5;

nuEM    1;//2.97e-07;
k       16.3; 
//k k [1 1 -3 1 0 0 0] 1; // kg*m/s^3*k
/*
*/
k1 0.02;
k2 25;//24; //24 liquid, 40 solid?
k3  40;//40;//40;
nu1_shadow 1.48e-05;
nu2_shadow 2.97e-07;
nu3_shadow 3e-07;

k_weld 0;//40; 

multiplierBuoy 8e8;
multiplierBuoyG 0;//5e9;//1.6e6;
sourceTime 0;

dmdtRelaxAlpha 10;//2.5;
dmdtRelaxPressure 0;//-0.25;//-0.005;//.03;//25;//-0.005;

cp1 1000;
cp2 620;
cp3 530;

SuFudge 0;
testFudge 0.0;

dsigmadT 0;

meltingT 1705.15;

T_0 1705.15;

cp 500;

rhoRef 8e3;

htot htot [1 -1 -2 0 0 0 0] 1;

Lf 2.6e5;//334000; // water

Tref 1705.15;


vsfRho true;
beta 0;//1.96e-5;

// Phase prop match stops spurious - reweight???
/*
phases
(
*/
Phase1 // air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
    cp              1000;
//    cp              381.5;
    k               0.02;
    Pr              0.74;
}
/*
Phase1 // water
{
    transportModel  Newtonian;
    CTLE            0.0;//1e-6;
    nu              2.97e-07; 
    rho             8e3;//4140;
    cp              500;
    k               16.3;
}
*/

Phase2 // ice
{
    transportModel  Newtonian;
    Tdep            false;
    Shomate         false;
    Tref            1705.15;
    beta            1.96e-5;
    nu              2.97e-07; 
    rho             8065;//4140;
    cp              800;
    k               16.3;
    k2Opt           true;
    k2a             10.33;
    k2b             15.4e-3;
    k2c             -7.0e-7;
}

Phase3 // water
{
    transportModel  Newtonian;
    CTLE            0.0;//1e-6;
    nu              2.97e-07; 
    rho             8052;//4140;
    cp              490;
    k               16.3;
    k3Opt           true;
    k3a             6.6;
    k3b             12.14e-3;
    k3c             0.0;
}
/*
);

sigmas
(
    (Phase1 Phase2) 0
    (Phase1 Phase3) 0
    (Phase2 Phase3) 0
);
*/
KunzCoeffs
{
    UInf            U20.0;
    tInf            t0.005; // L = 0.1 m
    Cc              C1000;
    Cv              C1000;
}

MerkleCoeffs
{
    UInf            20.0;
    tInf            0.005;  // L = 0.1 m
    Cc              80;
    Cv              1e-03;
}

WeldCoeffs
{
    UInf            1;
    tInf            1;  // L = 0.1 m
    Cc              1;
    Cv              1;
    Tmelt           302.93; //302.93; // 1940; // ti-6-4
    Tzero           0;
    Tone            1;
    Tmone           -1;
    kgOne           1;
    Mone            1;
    tOne            1;
    test            0;
    Cp              381.5;
    Lf              80160;
}


SchnerrSauerCoeffs
{
    n               1.6e+13;
    dNuc            2.0e-06;
    Cc              1;
    Cv              1;
}


// ************************************************************************* //
