cases/chpt4-ss304-3/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application             interGtawFoam;

startFrom               latestTime;

startTime               latestTime;//0;

stopAt                  endTime;

endTime                 40;

deltaT                  1e-3;

writeControl            adjustableRunTime;

writeInterval           2;

purgeWrite              0;

writeFormat             ascii;

writePrecision          6;

writeCompression        off;

timeFormat              general;

runTimeModifiable       yes;

adjustTimeStep          on;

maxCo                   0.5;//5;

maxAlphaCo      0.5;

maxDeltaT       1;

libs (
      "libdynamicFvMeshUser.so"
      "libOpenFOAM.so"
      "libsimpleSwakFunctionObjects.so"
      "libswakFunctionObjects.so"
      "libgroovyBC.so"
      "libYEADOfvOptions.so"
      );

functions
{
    #includeFunc  singleGraph
}

// ************************************************************************* //
